# 数据转换

In [1]:
import numpy as np
import pandas as pd

## 移除重复数据

In [2]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

DataFrame的duplicated方法返回一个布尔型Series，表示各行是否是重复行：

In [3]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

还有一个与此相关的drop_duplicates()方法，它用于返回一个移除了重复行的DataFrame：

In [4]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [5]:
data['v1'] = range(7)

data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [6]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [7]:
data.drop_duplicates(subset=['k1', 'k2'], keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

### 利用函数或映射进行数据转换

In [8]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 
                             'corned beef', 'Bacon', 'pastrami', 'honey ham',
                             'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [9]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow', 
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [10]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [11]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 替换值

In [12]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [13]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [14]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [15]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [16]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [17]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 重命名轴索引

In [18]:
data = pd.DataFrame(np.arange(12).reshape(3, 4),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [19]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [20]:
data.index = data.index.map(str.upper)

data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [21]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [22]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [23]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [24]:
_ = data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

## 离散化和面元划分

In [25]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [26]:
type(cats)

pandas.core.categorical.Categorical

In [27]:
cats.labels

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: 'labels' is deprecated. Use 'codes' instead
  """Entry point for launching an IPython kernel.

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [28]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [30]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [31]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [32]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [33]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [MiddleAged < Senior < YoungAdult < Youth]

In [34]:
data = np.random.rand(20)

pd.cut(data, 4, precision=2)

[(0.47, 0.71], (0.71, 0.94], (0.47, 0.71], (0.00089, 0.24], (0.00089, 0.24], ..., (0.00089, 0.24], (0.24, 0.47], (0.47, 0.71], (0.71, 0.94], (0.00089, 0.24]]
Length: 20
Categories (4, interval[float64]): [(0.00089, 0.24] < (0.24, 0.47] < (0.47, 0.71] < (0.71, 0.94]]

In [35]:
data = np.random.randn(1000)

cats = pd.qcut(data, 4)

cats

[(0.644, 3.182], (-3.417, -0.612], (-0.612, -0.0291], (-0.0291, 0.644], (0.644, 3.182], ..., (-3.417, -0.612], (-0.612, -0.0291], (-0.612, -0.0291], (0.644, 3.182], (-0.0291, 0.644]]
Length: 1000
Categories (4, interval[float64]): [(-3.417, -0.612] < (-0.612, -0.0291] < (-0.0291, 0.644] < (0.644, 3.182]]

In [36]:
pd.value_counts(cats)

(0.644, 3.182]       250
(-0.0291, 0.644]     250
(-0.612, -0.0291]    250
(-3.417, -0.612]     250
dtype: int64

In [37]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0291, 1.302], (-3.417, -1.203], (-1.203, -0.0291], (-0.0291, 1.302], (-0.0291, 1.302], ..., (-3.417, -1.203], (-1.203, -0.0291], (-1.203, -0.0291], (-0.0291, 1.302], (-0.0291, 1.302]]
Length: 1000
Categories (4, interval[float64]): [(-3.417, -1.203] < (-1.203, -0.0291] < (-0.0291, 1.302] < (1.302, 3.182]]

In [38]:
pd.value_counts(pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]))

(-0.0291, 1.302]     400
(-1.203, -0.0291]    400
(1.302, 3.182]       100
(-3.417, -1.203]     100
dtype: int64

## 检测和过滤异常值

## 排列和随机采样

利用numpy.random.permutation函数可以轻松实现对Series或DataFrame的列的排列工作（permuting，随机重排序）。通过需要排列的轴的长度调用permutation，可产生一个表示新顺序的整数数组：

In [3]:
df = pd.DataFrame(np.arange(5 * 4).reshape([5, 4]))

df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [4]:
sampler = np.random.permutation(5)

sampler

array([4, 1, 2, 0, 3])

In [5]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15

In [6]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [7]:
np.random.permutation(len(df))[:3]

array([3, 4, 0])

In [8]:
bag = np.array([5, 7, -1, 6, 4])

bag

array([ 5,  7, -1,  6,  4])

In [9]:
sampler = np.random.randint(0, len(bag), size=10)

sampler

array([2, 2, 3, 3, 4, 2, 1, 3, 3, 3])

In [10]:
draws = bag.take(sampler)

draws

array([-1, -1,  6,  6,  4, -1,  7,  6,  6,  6])

## 计算指标/哑变量

In [11]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [12]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [14]:
dummies = pd.get_dummies(df['key'], prefix='key')

dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [15]:
df_with_dummy = df[['data1']].join(dummies)

df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0